# Practice 2 : about read_csv

### check the pandas version

In [1]:
!conda list | grep pandas

pandas                    0.25.1           py37h0a44026_0

In [2]:
import pandas as pd

### read_csv basic

In [3]:
df = pd.read_csv('data/friend_list.csv')

In [4]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [5]:
df.head(5)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
df.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

### read_csv can read .txt

In [10]:
df = pd.read_csv('data/friend_list.txt')

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### read_csv can use delimiter

In [15]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [16]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### If data has no head ?

In [22]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [23]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

### We can assign columns' name

In [24]:
df.columns = ['name','age','job']

In [25]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### how to express the above in one line

In [26]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [27]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern